note/note-redis.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2019-01-24 Thu 21:14 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>redis 使用</title>
<meta name="generator" content="Org mode">
<meta name="author" content="manue1">
<link rel="stylesheet" type="text/css" href="css/worg.css" />
<!-- <link rel="shortcut icon" href="http://www.langdebuqing.com/images/favicon.ico" type="image/x-icon" /> -->
</head>
<body>
<div id="preamble" class="status">
<div id="navbar">
    <ul>
        <li id="site-master"><a href="https://www.manue1.site/">Manue1's Journal</a></li>
        <li><a class="navbar-item" href="https://www.manue1.site/write.html">All Posts</a> </li>
        <li><a class="navbar-item" href="https://www.manue1.site/link.html">Links</a> </li>
        <li class="search">
            <form action="http://google.com/search" method="get" accept-charset="utf-8">
                <input type="search" id="search" name="q" autocomplete="off" maxlength="30" placeholder="Search..">
                <input type="hidden" name="q" value="site:www.manue1.com">
            </form>
        </li>
    </ul>
</div>
</div>
<div id="content">
<h1 class="title">redis 使用</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org925ca3c">1. redis</a>
<ul>
<li><a href="#org59df7da">1.1. redis 安装使用</a></li>
<li><a href="#orgf7ca7e7">1.2. 数据结构与对象</a>
<ul>
<li><a href="#org7ea1915">1.2.1. SDS</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org925ca3c" class="outline-2">
<h2 id="org925ca3c"><span class="section-number-2">1</span> redis</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org59df7da" class="outline-3">
<h3 id="org59df7da"><span class="section-number-3">1.1</span> redis 安装使用</h3>
<div class="outline-text-3" id="text-1-1">
<p>
redis开发使用的话，推荐docker直接部署，避免浪费时间，redis 配置文件<br>
<code>/etc/redis/redis.conf</code> 参数简单配置满足日常开发需求<br>
</p>

<pre class="example">
bind 127.0.0.1 远程访问
requirepass manue1sec  设置密码

</pre>

<p>
使用 <code>redis-cli -h x.x.x.x -p 6379 -a manue1sec</code> 远程连接管理,<br>
</p>

<p>
redis 数据库里面的每个键值对(key-value pair)都是由对象(object)组成的,其中:<br>
数据库键总是一个字符串对象(string object);而数据库键的值则可以是字符串对象、<br>
列表对象(list object)、哈希对象(hashobject)、集合对象(set object)、<br>
有序集合对象(sorted set object)这五种对象中的其中一种<br>
</p>
</div>
</div>

<div id="outline-container-orgf7ca7e7" class="outline-3">
<h3 id="orgf7ca7e7"><span class="section-number-3">1.2</span> 数据结构与对象</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org7ea1915" class="outline-4">
<h4 id="org7ea1915"><span class="section-number-4">1.2.1</span> SDS</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
redis没有使用c语言内的以空字符结尾的字符数组作为字符串，而是自己定义了一种SDS，<br>
simple dynamic string，简单动态字符串</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>
    <a href="">manue1</a> 搭建和维护，使用
    <a href="https://www.gnu.org/software/emacs/">Emacs</a>
    <a href="http://orgmode.org/">Org mode</a> 编辑和构建
</p>
<script src="http://www.langdebuqing.com/css/jquery-2.1.3.min.js"></script>
<script src="http://www.langdebuqing.com/css/main.js"></script>
</div>
</body>
</html>